{
  "title": "Head of Open Science",
  "p": [
    "Rosetta is reimagining the future of open science. Today, we’re building the technology and team to create open markets for knowledge. We envision a future where scientists are free to experiment on the most pressing problems, and earn the rewards they deserve for it.",
    "Our mission is to ensure all knowledge survives forever, which is why we’re building on Arweave. The goal of Rosetta is to build the world’s most compelling digital publishing network, whilst ensuring the scientific method survives forever on a persistent distributed protocol.",
    "We’re the first incubation project from Hansa, a $10mm collective, so we’ve got the capital to take us far.",
    "We are seeking a head of open science to help promote Rosetta, and shape the product to maintain the best principles of open science."
  ],
  "who": [
    "You are experienced. You’ve done it before. Your experience will help you avoid pitfalls, and help not only you, but the whole company move faster, and build better.",
    "You thrive in fast paced environments. At this stage we’re still learning. You will iterate with customers, designers, and product managers on high impact work.",
    "You take pride in open science. You understand the core fundamental principles that drive open science, and instil them in our organisation.",
    "You have empathy for customers. You build with the customer in mind.",
    "Autodidact. You are willing to learn new things alongside us as we reimagine science from the ground up. We’re just at the beginning too."
  ],
  "do": [
    "Drive the project forward by owning your deliverables, and ensuring collaboration with others that ensure open science fundamentals are embedded in the product with interesting new features to build the world’s most compelling digital publisher.",
    "Lead the education efforts for the protocol, platform, and open science movement.",
    "Boots on the ground at events to show our presence, which will require travel.",
    "Drive partnerships with organisations that see the benefits in an open access publisher.",
    "You enjoy and thrive on the hustle - meeting new people, maintaining relationships and ultimately closing collaborations",
    "Bring open science to life for all scientists around the world."
  ],
  "have": [
    "Demonstrated passion for web3, and an open decentralised web.",
    "Understanding of web3 chains, and protocols.",
    "You have working relationships with organisations that publish open access, and believe in open science principles.",
    "You have knowledge of open science, and it’s fundamental principles"
  ],
  "get": [
    "80k - 100k base salary + $ROS tokens (based on experience).",
    "Remote environment, or on-site in Melbourne, Australia.",
    "Travel opportunities, and continuous learning."
  ]
}
