{
  "title": "Product Lead",
  "p": [
    "Rosetta is reimagining the future of open science. Today, we’re building the technology and team to create open markets for knowledge. We envision a future where scientists are free to experiment on the most pressing problems, and earn the rewards they deserve for it.",
    "Our mission is to ensure all knowledge survives forever, which is why we’re building on Arweave. The goal of Rosetta is to build the world’s most compelling digital publishing network, whilst ensuring the scientific method survives forever on a persistent distributed protocol.",
    "We’re the first incubation project from Hansa, a $10mm collective, so we’ve got the capital to take us far. ",
    "We are seeking someone to take the lead of our product. The perfect candidate is someone who understands what it takes to build the most compelling product in a category, and innovate in an industry that doesn’t like new things. You’ll be a critical part of shaping the company’s product, and future. You will be the building bones of the protocol, and making decisions that control the trajectory."
  ],
  "who": [
    "Product experience: 4+ years of PM experience at early stage, or growth startups.",
    "You’re a creative product thinker who loves collaborating across the company with engineering, marketing, design, and sales.",
    "Strong conceptual and analytical problem-solving skills and willingness to roll up the sleeves and get the job done.",
    "Do whatever it takes to make your product, and team successful. Whether that’s writing a QA plan, or finding the root cause of a users problems/frustrations.",
    "Leadership. You’ve mentored product managers, engineers, and designers in how to work together to build great products.",
    "Entrepreneurial Spirit: Self-starter who thrives in a fast-paced environment, deals well with ambiguity, and focuses on driving impact.",
    "Analytical horsepower. Demonstrated skill for digging deep into the data, and thinking from first principles to deliver the best results. Experience doing user research, and designing customer feedback interviews.",
    "Crisp communicator, high attention to detail, and results orientated."
  ],
  "do": [
    "Take charge of early development of the product (deciding on its direction and key features)",
    "Form ideas with research, and data: leverage market/analytics data and customer research to inform product opportunities and deeply understand customer needs.",
    "Plan with intention: own the customer roadmap, orienting product investments to clearly defined, measurable outcomes.",
    "Ruthlessly prioritise, and build iteratively. Define focused MVPs for product features. Act as the product owner to write user stories, hosting ceremonies, community calls, etc.",
    "Conduct market research including competition, supported by on-going communication with users, and non-users.",
    "Drive product launches.",
    "Set development project priorities for the particular product based on input from all stakeholders."
  ],
  "get": [
    "80k - 120k base salary + $ROS tokens (based on experience).",
    "Remote environment, or on-site in Melbourne, Australia.",
    "Travel opportunities, and continuous learning."
  ]
}
